In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
data_df = pd.read_csv('Data Files/fields.csv', index_col=['Field'])

In [3]:
data_df

                  ID           Name
Field
Electrical         1     Adam Jones
Mechanical         2  Edward Elrich
Computer Science   3    Stain Steve
Media Science      4      Ken Adams
Sportsman          5    Ross Taylor

In [8]:
#Using the to_csv method we can write the info from a data frame to a csv file
data_df.to_csv('Data Files/fields2.csv')

In [9]:
#By default, the delimiter is a ','. We can change that to other delimiters using the sep argument
data_df.to_csv('Data Files/fields2.csv', sep='|')

In [10]:
read_df = pd.read_csv('Data Files/fields2.csv')

In [11]:
read_df

                    Field|ID|Name
0         Electrical|1|Adam Jones
1      Mechanical|2|Edward Elrich
2  Computer Science|3|Stain Steve
3       Media Science|4|Ken Adams
4         Sportsman|5|Ross Taylor

In [12]:
#Sometimes, it is better to view the result of the changes we are going to make to csv before we actually make them
#This can b performed by using the sys.stdout to see the changes that are going to be made in the file
#If its suitable then we can apply it to the actual text file

import sys

data_df.to_csv(sys.stdout, sep = ':')

Field:ID:Name
Electrical:1:Adam Jones
Mechanical:2:Edward Elrich
Computer Science:3:Stain Steve
Media Science:4:Ken Adams
Sportsman:5:Ross Taylor

In [13]:
none_df = pd.read_csv('Data Files/none_fields.csv')

In [14]:
none_df

    ID           Name       Field
0  1.0     Adam Jones  Electrical
1  2.0  Edward Elrich           -
2  3.0      Ken Adams         NaN
3  4.0    Ross Taylor   Sportsman
4  NaN    Stain Steve         NaN

In [15]:
#In case of NaN values, they are represented by empty space in a csv file
#We would want to use some other thing to denote the values i.e. for suppose lets use - to represent them then

none_df.to_csv(sys.stdout, na_rep = '-') #Changes all NaN values to -

,ID,Name,Field
0,1.0,Adam Jones,Electrical
1,2.0,Edward Elrich,-
2,3.0,Ken Adams,-
3,4.0,Ross Taylor,Sportsman
4,-,Stain Steve,-

In [17]:
#As one can see, the values are being applied also on the headers and index by default
#We can disable them by passing False to them

data_df.to_csv(sys.stdout, header=False, index=False, sep='|')

1|Adam Jones
2|Edward Elrich
3|Stain Steve
4|Ken Adams
5|Ross Taylor

In [18]:
data_df = pd.read_csv('Data Files/fields.csv')

In [19]:
data_df

   ID           Name             Field
0   1     Adam Jones        Electrical
1   2  Edward Elrich        Mechanical
2   3    Stain Steve  Computer Science
3   4      Ken Adams     Media Science
4   5    Ross Taylor         Sportsman

In [26]:
#We can also write subset of columns from one file to another in any order we want
data_df.to_csv(sys.stdout, index=False, columns=['Name','Field'])

Name,Field
Adam Jones,Electrical
Edward Elrich,Mechanical
Stain Steve,Computer Science
Ken Adams,Media Science
Ross Taylor,Sportsman

In [30]:
#Like DataFrames, we can also use to_csv method for Series
#Suppose we want to create a series for dates

#Using the date_range we can create a Series of dates
dates = pd.date_range('1/1/2020', periods=7) #Creates a datetime index with dates from 01 to 07 of Jan/2020

In [31]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [32]:
#Now using the date time indexes as index for our series
date_series = Series(['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday'], index=dates)

In [33]:
date_series

2020-01-01       Monday
2020-01-02      Tuesday
2020-01-03    Wednesday
2020-01-04     Thursday
2020-01-05       Friday
2020-01-06     Saturday
2020-01-07       Sunday
Freq: D, dtype: object

In [34]:
#We can now write this data to our csv file
date_series.to_csv('Data Files/daydates.csv')

In [42]:
#Reading data from such a csv will require a bit of wrangling though i.e removing header and index
days = pd.read_csv('Data Files/daydates.csv')

In [43]:
days

   Unnamed: 0          0
0  2020-01-01     Monday
1  2020-01-02    Tuesday
2  2020-01-03  Wednesday
3  2020-01-04   Thursday
4  2020-01-05     Friday
5  2020-01-06   Saturday
6  2020-01-07     Sunday